[
    {
        "id": "1",
        "region": "Whispering Woods",
        "exits": {
            "north": "2",
            "east": "7",
            "south": "100",
            "west": "101"
        },
        "description": "THE BLIGHTED CROSSROADS\n\nYou stand at a misty crossroads where ancient paths converge. Twisted trees frame the scene, their bark black as pitch. The remnants of an old stone marker lie shattered at your feet. An eerie silence hangs in the air, broken only by the occasional distant howl."
    },
    {
        "id": "2",
        "region": "Whispering Woods",
        "exits": {
            "north": "3",
            "south": "1",
            "east": "4"
        },
        "description": "TWISTED FOREST EDGE\n\nThe path leads to the threshold of a dense forest. Trees stand unnaturally twisted, their branches reaching down like grasping hands. A sickly green phosphorescence emanates from fungi growing on rotting logs. The undergrowth rustles with unseen movements."
    },
    {
        "id": "3",
        "region": "Whispering Woods",
        "exits": {
            "south": "2",
            "east": "5",
            "west": "6"
        },
        "description": "HEART OF THE WHISPERING WOODS\n\nYou've penetrated deep into the suffocating forest. The canopy above blocks all sunlight, casting everything in perpetual twilight. The trees here seem to pulse with malevolent life. You could swear you hear voices in the creaking of branches – ancient, hateful whispers that speak of forbidden things."
    },
    {
        "id": "4",
        "region": "Whispering Woods",
        "exits": {
            "west": "2",
            "north": "5"
        },
        "description": "FORGOTTEN DRUID CIRCLE\n\nA ring of megalithic stones rises from the forest floor, each carved with symbols now warped and corrupted. At the center lies a cracked altar stone, stained with what might be centuries-old blood. The air feels charged with dormant power, waiting to be awakened."
    },
    {
        "id": "5",
        "region": "Whispering Woods",
        "exits": {
            "west": "3",
            "south": "4"
        },
        "description": "WITCH'S HOLLOW\n\nA decrepit cottage stands in a small clearing, its walls bulging and roof sagging. Strange charms made of bone and feather hang from nearby branches. A cauldron sits abandoned outside, its contents long since hardened into a black, glass-like substance. The ground is littered with strange herbs and tiny animal skulls."
    },
    {
        "id": "6",
        "region": "Whispering Woods",
        "exits": {
            "east": "3"
        },
        "description": "THE STRANGLING GROVE\n\nThe forest here has transformed into a nightmarish tangle. Vines as thick as your arm writhe slowly across the ground. The trees grow so densely that they form living walls. Several animal carcasses hang suspended in the branches, completely enveloped by the hungry vegetation."
    },
    {
        "id": "7",
        "region": "Forsaken Keep",
        "exits": {
            "west": "1",
            "east": "8",
            "south": "11"
        },
        "description": "RUINED GATEHOUSE\n\nYou stand before the remains of what was once a mighty fortress entrance. Stone walls, partially collapsed, rise on either side. The massive iron gates lie twisted and broken on the ground. Ancient battle scars mark the stonework, evidence of the fortress's violent fall."
    },
    {
        "id": "8",
        "region": "Forsaken Keep",
        "exits": {
            "west": "7",
            "north": "9",
            "east": "10"
        },
        "description": "FORGOTTEN COURTYARD\n\nThe cracked flagstones of a once-grand courtyard spread before you. A dry fountain stands at the center, its basin filled with dark stagnant water. Crumbling statues of warriors line the perimeter, their features worn smooth by time. The ruins of barracks and storehouses loom in the shadows."
    },
    {
        "id": "9",
        "region": "Forsaken Keep",
        "exits": {
            "south": "8",
            "east": "15"
        },
        "description": "COLLAPSED THRONE ROOM\n\nThis vast chamber must once have been magnificent. Now, half the ceiling has caved in, allowing feeble moonlight to illuminate the destruction. A massive throne of black stone dominates the far wall, cracked down the middle. Tattered banners bearing unknown heraldry hang forlornly from the walls."
    },
    {
        "id": "10",
        "region": "Forsaken Keep",
        "exits": {
            "west": "8",
            "down": "12"
        },
        "description": "DESECRATED TEMPLE\n\nWhat was once a sacred place now reeks of corruption. Broken pews face a shattered altar. Religious icons have been defaced with disturbing symbols. The stained glass windows depict scenes of torment rather than salvation. A spiral staircase descends into darkness beneath the altar."
    },
    {
        "id": "11",
        "region": "Forsaken Keep",
        "exits": {
            "north": "7",
            "down": "13"
        },
        "description": "ABANDONED ARMORY\n\nRusted weapons and rotted leather armor line the walls of this chamber. Massive stone slabs form weapon racks, now mostly empty. A few corroded blades remain, their once-fine craftsmanship still evident despite their decay. In one corner, a trapdoor leads downward."
    },
    {
        "id": "12",
        "region": "Undercrypt Depths",
        "exits": {
            "up": "10",
            "north": "14"
        },
        "description": "RITUAL CHAMBER\n\nThis underground chamber pulsates with dark energy. Runes carved into the floor glow with a sickly purple light. Stone channels built into the floor converge at a central basin. The walls are lined with alcoves containing bizarre artifacts – skulls of unknown creatures, crystalline structures that seem to move when not directly observed."
    },
    {
        "id": "13",
        "region": "Undercrypt Depths",
        "exits": {
            "up": "11",
            "east": "14"
        },
        "description": "FORGOTTEN CATACOMBS\n\nRows of ancient sarcophagi line the walls of this vast underground chamber. Most have been opened, their contents missing. Cobwebs drape across everything like ghostly curtains. The air is stale and thick with the dust of ages. Strange glyphs adorn the walls, their meaning lost to time."
    },
    {
        "id": "14",
        "region": "Undercrypt Depths",
        "exits": {
            "west": "13",
            "south": "12",
            "east": "15"
        },
        "description": "UNDERGROUND NEXUS\n\nMassive stone tunnels converge in this cavernous space. Ancient pillars, carved to resemble writhing tentacled beings, support the distant ceiling. The ground is unnaturally smooth, as if melted and reformed. A constant, barely audible hum emanates from the very rock itself."
    },
    {
        "id": "15",
        "region": "Undercrypt Depths",
        "exits": {
            "west": "14",
            "up": "9"
        },
        "description": "ABYSSAL SHRINE\n\nA vast pit dominates the center of this chamber, its bottom lost in darkness. Around it stands a circle of obsidian obelisks, each inscribed with writing that seems to shift and change as you try to read it. The air is unnaturally cold, and strange whispers echo from the pit. A narrow staircase winds upward along the wall."
    },
    {
        "id": "99",
        "region": "Veiled Between",
        "exits": {},
        "description": "THE HIDDEN INTERstice\n\nThe world blurs into a corridor of starlight and stillness. Floating glyphs hum softly in the gloom, and a single obsidian archway frames the void beyond. Time feels paused here, as though you stand between one heartbeat and the next."
    },
    {
        "id": "100",
        "region": "Whispering Woods",
        "exits": {
            "north": "1"
        },
        "description": "ABANDONED CHICKEN FARM - WEST FIELD\n\nA dilapidated wooden fence surrounds this overgrown field. Feathers drift lazily across the patchy grass. A weather-beaten coop leans precariously to one side, its door hanging open. Chickens wander about freely, pecking at the ground without a care in the world. The distant sound of clucking fills the air."
    },
    {
        "id": "101",
        "region": "Whispering Woods",
        "exits": {
            "east": "1"
        },
        "description": "ABANDONED CHICKEN FARM - EAST FIELD\n\nThis neglected farmyard is overrun with chickens. Broken feeding troughs lie scattered about, and a collapsed barn provides some shelter from the elements. The chickens seem to have multiplied unchecked, forming small flocks that roam the area. Feathers and droppings cover everything."
    }
]
